app/Views/layout/sidebar_backup.php

    $db = \Config\Database::connect();
    $role = session()->get('role');

    $menu = $db->table('tblweb_aksesmenu')
        ->select('tblweb_menu.*')
        ->join('tblweb_menu', 'tblweb_menu.id = tblweb_aksesmenu.menu_id')
        ->where(['tblweb_aksesmenu.privilege_id ' => $role, 'tblweb_menu.stts' => "true", 'tblweb_menu.app' => "web 1"])
        ->orderBy('tblweb_menu.id', 'ASC')
        ->get()->getResultArray();
---
SELECT `tblweb_menu`.*
FROM `tblweb_aksesmenu`
JOIN `tblweb_menu` ON `tblweb_menu`.`id` = `tblweb_aksesmenu`.`menu_id`
WHERE `tblweb_aksesmenu`.`privilege_id` = '111'
AND `tblweb_menu`.`stts` = 'true'
AND `tblweb_menu`.`app` = 'web 1'
ORDER BY `tblweb_menu`.`id` ASC

                    </a>

                    <?php
                    $subMenu = $db->table('tblweb_submenu')
                        ->select('tblweb_submenu.*')
                        ->join('tblweb_menu', 'tblweb_submenu.menu_id = tblweb_menu.id')
                        ->where(['tblweb_submenu.menu_id' => $m['id'], 'tblweb_submenu.stts' => "true"])
                        ->orderBy('tblweb_submenu.id', 'ASC')
                        ->get()->getResultArray();
---
SELECT `tblweb_submenu`.*
FROM `tblweb_submenu`
JOIN `tblweb_menu` ON `tblweb_submenu`.`menu_id` = `tblweb_menu`.`id`
WHERE `tblweb_submenu`.`menu_id` = '1'
AND `tblweb_submenu`.`stts` = 'true'
ORDER BY `tblweb_submenu`.`id` ASC