app/Models/AuthModel.php

    function login($username, $password, $stts_login_1)
    {
        return $this->db->table('tblweb_users')->where(['username' => $username, 'password' => $password, 'enable_login' => $stts_login_1])
            ->select('tblweb_users.*, tblweb_privilege.privilege_name , tblweb_privilege.id AS privilege_id, ')
            ->join('tblweb_privilege', 'tblweb_privilege.id = tblweb_users.privilege')
            ->join('tblsysuserposition', 'tblsysuserposition.iduserposition = tblweb_users.position')
            ->get()->getRowArray();
---
SELECT `tblweb_users`.*, `tblweb_privilege`.`privilege_name`, `tblweb_privilege`.`id` AS `privilege_id`
FROM `tblweb_users`
JOIN `tblweb_privilege` ON `tblweb_privilege`.`id` = `tblweb_users`.`privilege`
JOIN `tblsysuserposition` ON `tblsysuserposition`.`iduserposition` = `tblweb_users`.`position`
WHERE `username` = 'admin'
AND `password` = 'd033e22ae348aeb5660fc2140aec35850c4da997'
AND `enable_login` = 'aktif'

    function cek_login($username, $password, $stts_login_2)
    {
        return $this->db->table('tblweb_users')->where(['username' => $username, 'password' => $password, 'enable_login' => $stts_login_2])
            ->select('tblweb_users.*, tblweb_privilege.privilege_name , tblweb_privilege.id AS privilege_id, ')
            ->join('tblweb_privilege', 'tblweb_privilege.id = tblweb_users.privilege')
            ->join('tblsysuserposition', 'tblsysuserposition.iduserposition = tblweb_users.position')
            ->get()->getRowArray();
---
SELECT `tblweb_users`.*, `tblweb_privilege`.`privilege_name`, `tblweb_privilege`.`id` AS `privilege_id`
FROM `tblweb_users`
JOIN `tblweb_privilege` ON `tblweb_privilege`.`id` = `tblweb_users`.`privilege`
JOIN `tblsysuserposition` ON `tblsysuserposition`.`iduserposition` = `tblweb_users`.`position`
WHERE `username` = 'admin'
AND `password` = 'd033e22ae348aeb5660fc2140aec35850c4da997'
AND `enable_login` = 'blokir'