app/Models/MasterModel.php

SELECT *
FROM `tblweb_users`
JOIN `tblsysuserposition` ON `tblsysuserposition`.`iduserposition` = `tblweb_users`.`position`
JOIN `tblweb_privilege` ON `tblweb_privilege`.`id` = `tblweb_users`.`privilege`
---
    public function getdataMasterUser()
    {
        return  $this->db->table('tblweb_users')
            ->join('tblsysuserposition', 'tblsysuserposition.iduserposition = tblweb_users.position')
            ->join('tblweb_privilege', 'tblweb_privilege.id = tblweb_users.privilege')
            ->get()->getResultArray();

SELECT *
FROM `tblweb_privilege`
---
    public function getdataPrivilege()
    {
        return $this->db->table('tblweb_privilege')->get()->getResultArray();

SELECT *
FROM `tblsysuserposition`
---
    public function getdataPosition()
    {
        return $this->db->table('tblsysuserposition')->get()->getResultArray();

SELECT *
FROM `tblweb_menu`
SELECT `tblweb_submenu`.*, `tblweb_menu`.`menu`
FROM `tblweb_submenu`
JOIN `tblweb_menu` ON `tblweb_menu`.`id` =`tblweb_submenu`.`menu_id`
---
    public function getMenu()
    {
        $data = [
            'stts' => true,
            'smg' => "Data menu...!",
            'menu' => $this->db->table('tblweb_menu')->get()->getResultArray(),
            'subMenu' => $this->db->table('tblweb_submenu')
                ->select('tblweb_submenu.*,tblweb_menu.menu')
                ->join('tblweb_menu', 'tblweb_menu.id =tblweb_submenu.menu_id')
                ->get()->getResultArray(),

SELECT *
FROM `tblweb_privilege`
---
    public function getRole()
    {
        return $this->db->table('tblweb_privilege')->get()->getResultArray();