app/Models/ScheduleModel.php

    public function getdataHoliday()
    {
        return $this->db->table('tblmas_holiday')->get()->getResultArray();
---
SELECT *
FROM `tblmas_holiday`